caAERS/software/jbi/caaers2adeers-sync/core-camel-su/src/test/resources/xslt/test4.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <stud:updateStudy xmlns:stud="http://schema.integration.caaers.cabig.nci.nih.gov/study">
            <stud:studies>
                <stud:study>
                    <shortTitle>Randomized Phase II 2 x 2 Factorial Trial of the Addition of Carboplatin +/- Bevacizumab
                        to Neoadjuvant Weekly Paclitaxel Followed by Dose-Dense AC in Hormone
                        Receptor-Poor/HER2-Negative Resectable Breast Cancer
                    </shortTitle>
                    <phaseCode>Phase II Trial</phaseCode>
                    <status>Active - Trial is open to accrual</status>
                    <adeersReporting>true</adeersReporting>
                    <studyPurpose>Treatment</studyPurpose>
                    <aeTermUnique>true</aeTermUnique>
                    <stud:aeTerminology>
                        <stud:ctcVersion>
                            <name>4</name>
                        </stud:ctcVersion>
                    </stud:aeTerminology>
                    <stud:diseaseTerminology>
                        <diseaseCodeTerm>CTEP</diseaseCodeTerm>
                    </stud:diseaseTerminology>
                    <fundingSponsor>
                        <organizationAssignedIdentifier>
                            <value>CALGB-40603</value>
                        </organizationAssignedIdentifier>
                        <stud:studyFundingSponsor>
                            <stud:organization>
                                <name>Cancer Therapy Evaluation Program</name>
                                <nciInstituteCode>CTEP</nciInstituteCode>
                            </stud:organization>
                        </stud:studyFundingSponsor>
                    </fundingSponsor>
                    <coordinatingCenter>
                        <organizationAssignedIdentifier>
                            <value>CALGB-40603</value>
                        </organizationAssignedIdentifier>
                        <stud:studyCoordinatingCenter>
                            <stud:organization>
                                <name>Cancer and Leukemia Group B</name>
                                <nciInstituteCode>CALGB</nciInstituteCode>
                                <type>CGP</type>
                            </stud:organization>
                            <studyInvestigators>
                                <stud:studyInvestigator>
                                    <roleCode>PI</roleCode>
                                    <stud:siteInvestigator>
                                        <stud:investigator>
                                            <firstName>William</firstName>
                                            <lastName>Sikov</lastName>
                                            <nciIdentifier>1777</nciIdentifier>
                                        </stud:investigator>
                                    </stud:siteInvestigator>
                                </stud:studyInvestigator>
                            </studyInvestigators>
                            <studyPersonnels/>
                        </stud:studyCoordinatingCenter>
                    </coordinatingCenter>
                    <treatmentAssignments>
                        <stud:treatmentAssignment>
                            <code>ARM1</code>
                            <description>Cycle = 19 weeks:
                                Paclitaxel: 80 mg/m2 IV over 1 hr on day 1 of wks 1-12
                                Doxorubicin: 60 mg/m2/ IV over 5-10 min on day 1 of wks 13, 15, 17 and 19
                                Cyclophosphamide: 600 mg/m2 IV over 5-30 min on day 1 of wks 13, 15, 17 and 19
                            </description>
                        </stud:treatmentAssignment>
                        <stud:treatmentAssignment>
                            <code>ARM2</code>
                            <description>Cycle = 19 weeks:
                                Paclitaxel: 80 mg/m2 IV over 1 hr on day 1 of wks 1-12
                                Bevacizumab: 10 mg/kg over 30-90 min on day 1 of wks 1, 3, 5, 7, 9, 11, 13, 15 and 17
                                Doxorubicin: 60 mg/m2/ IV over 5-10 min on day 1 of wks 13, 15, 17 and 19
                                Cyclophosphamide: 600 mg/m2 IV over 5-30 min on day 1 of wks 13, 15, 17 and 19
                            </description>
                        </stud:treatmentAssignment>
                        <stud:treatmentAssignment>
                            <code>ARM3</code>
                            <description>Cycle = 19 weeks:
                                Paclitaxel: 80 mg/m2 IV over 1 hr on day 1 of wks 1-12
                                Carboplatin: AUC 6 IV over 30 min on day 1 of wks 1, 4, 7 and 10
                                Doxorubicin: 60 mg/m2/ IV over 5-10 min on day 1 of wks 13, 15, 17 and 19
                                Cyclophosphamide: 600 mg/m2 IV over 5-30 min on day 1 of wks 13, 15, 17 and 19
                            </description>
                        </stud:treatmentAssignment>
                        <stud:treatmentAssignment>
                            <code>ARM4</code>
                            <description>Cycle = 19 weeks:
                                Paclitaxel: 80 mg/m2 IV over 1 hr on day 1 of wks 1-12
                                Carboplatin: AUC 6 IV over 30 min on day 1 of wks 1, 4, 7 and 10
                                Bevacizumab: 10 mg/kg over 30-90 min on day 1 of wks 1, 3, 5, 7, 9, 11, 13, 15 and 17
                                Doxorubicin: 60 mg/m2/ IV over 5-10 min on day 1 of wks 13, 15, 17 and 19
                                Cyclophosphamide: 600 mg/m2 IV over 5-30 min on day 1 of wks 13, 15, 17 and 19
                            </description>
                        </stud:treatmentAssignment>
                        <stud:treatmentAssignment>
                            <code>SURG</code>
                            <description>Surgery</description>
                        </stud:treatmentAssignment>
                        <stud:treatmentAssignment>
                            <code>RADIATION</code>
                            <description>Ipsilateral remaining breast or chest wall RT: 5000 cGy in 2 Gy fractions or
                                5040 cGy in 1.8 Gy fractions
                                Intact breast RT: 1000-1600 cGy in 180-200 Gy fractions
                                Supraclavicular field RT: 4500-5040 cGy in 1.8-2 Gy fractions
                            </description>
                        </stud:treatmentAssignment>
                    </treatmentAssignments>
                    <studyAgents>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>704865</nscNumber>
                            </stud:agent>
                            <indType>OTHER</indType>
                            <partOfLeadIND>true</partOfLeadIND>
                        </stud:studyAgent>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>673089</nscNumber>
                            </stud:agent>
                            <indType>NA_COMMERCIAL</indType>
                            <partOfLeadIND>false</partOfLeadIND>
                        </stud:studyAgent>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>241240</nscNumber>
                            </stud:agent>
                            <indType>NA_COMMERCIAL</indType>
                            <partOfLeadIND>false</partOfLeadIND>
                        </stud:studyAgent>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>123127</nscNumber>
                            </stud:agent>
                            <indType>NA_COMMERCIAL</indType>
                            <partOfLeadIND>false</partOfLeadIND>
                        </stud:studyAgent>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>26271</nscNumber>
                            </stud:agent>
                            <indType>NA_COMMERCIAL</indType>
                            <partOfLeadIND>false</partOfLeadIND>
                        </stud:studyAgent>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>614629</nscNumber>
                            </stud:agent>
                            <indType>NA_COMMERCIAL</indType>
                            <partOfLeadIND>false</partOfLeadIND>
                        </stud:studyAgent>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>725961</nscNumber>
                            </stud:agent>
                            <indType>NA_COMMERCIAL</indType>
                            <partOfLeadIND>false</partOfLeadIND>
                        </stud:studyAgent>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>34521</nscNumber>
                            </stud:agent>
                            <indType>NA_COMMERCIAL</indType>
                            <partOfLeadIND>false</partOfLeadIND>
                        </stud:studyAgent>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>613795</nscNumber>
                            </stud:agent>
                            <indType>NA_COMMERCIAL</indType>
                            <partOfLeadIND>false</partOfLeadIND>
                        </stud:studyAgent>
                    </studyAgents>
                    <ctepStudyDiseases>
                        <stud:ctepStudyDisease>
                            <stud:diseaseTerm>
                                <meddraCode>10006190</meddraCode>
                            </stud:diseaseTerm>
                            <leadDisease>true</leadDisease>
                        </stud:ctepStudyDisease>
                    </ctepStudyDiseases>
                    <studyDevices/>
                </stud:study>
            </stud:studies>
        </stud:updateStudy>
    </soapenv:Body>
</soapenv:Envelope>
